In [2]:
import pandas as pd 

data =  [(1,2,3,4),
         (5,6,7,8),
         (8,10,11,12),
         (13,14,15,16)]

df=pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

Selecionando uma coluna:

In [3]:
df['c1']

l1     1
l2     5
l3     8
l4    13
Name: c1, dtype: int64

In [4]:
type(df['c1'])

pandas.core.series.Series

Selecionando mais de uma coluna:

In [5]:
df[['c3','c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   8
l4  15  13

In [6]:
type(df[['c3','c1']])

pandas.core.frame.DataFrame

Selecionando linhas:

In [7]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   8  10  11  12
l4  13  14  15  16

In [8]:
df[2:]

    c1  c2  c3  c4
l3   8  10  11  12
l4  13  14  15  16

In [9]:
df[1:3]

    c1  c2  c3  c4
l2   5   6   7   8
l3   8  10  11  12

In [10]:
df[1:][['c3','c1']]

    c3  c1
l2   7   5
l3  11   8
l4  15  13

Fazendo seleções a partir dos rótulos das linhas:

In [11]:
df.loc['l3'] #Chama a Linha 3

c1     8
c2    10
c3    11
c4    12
Name: l3, dtype: int64

Posso selecionar mais de uma linha

In [12]:
df.loc[['l3','l2']]

    c1  c2  c3  c4
l3   8  10  11  12
l2   5   6   7   8

Podemos também selecionar um elemento do DataFrame utilizando o loc

In [13]:
df.loc['l1','c2']

2

In [14]:
df.iloc[0,1] # O iloc utiliza os índices numéricos ,e  não os índices

2

O loc e iloc também permitem que chamemos parte do DataFrame:

In [16]:
df.loc[['l3','l1'],['c4','c1']]

    c4  c1
l3  12   8
l1   4   1

In [18]:
df.iloc[[2,0],[3,0]]

    c4  c1
l3  12   8
l1   4   1